/*===============================================================*/
/*====================    89E58中斷控制   =======================*/
/*=======  使用中斷時需注意，如果SPI訊號入到一半時使用中斷 ======*/
/*=======  會造成訊號傳輸不完整而造成顯示或讀取錯誤        ======*/
/*=======  解決辦法：可使用"旗標"來讓訊號輸入完再中斷      ======*/
/*===============================================================*/

//=================									中斷-相關暫存器設定 								=====================*/
//  			  功能 : ON/OFF  -  	T2 		UART 	 T1		INT1 		T0   INT0    											 */
//------------------------------------------------------------------------------------------ */
//  中斷致能 IE :  EA 		 - 		ET2		 ES 	ET1 	 EX1 	 ET0  	EX0    											 */
//  中斷優先 IP :   - 		 - 		PT2 	 PS 	PT1  	 PX1 	 PT0  	PX0    											 */
//------------------------------------------------------------------------------------------ */
//  計時/數控制 TCON :  TF1  TR1  TF0  TR0	 IE1  IT1  IE0  IT0  		   											 */
//	TF1-> Timer1中斷(溢位)旗標、TR1-> Timer1啟動開關、TF0-> Timer0中斷旗標、TR0-> Timer0開關 */													 											 **/
//  		IE1-> INT1中斷旗標、IT1-> INT1訊號種類 。IE0-> INT0中斷旗標、IT0-> INT0訊號種類  		 */
//------------------------------------------------------------------------------------------ */
//  中斷向量 : 0-INT0 、 1-T0 、 2-INT1 、 3-T1 、 4-UART 、 5-T2                            */
//=================										計時計數-相關暫存器設定 							=================*/
//  計時/計數模式 TMOD： T1:[GATE	C/T  M1	 M0]	 T0 :[GATE  C/T  M1  M0]									   */
//												Mode 0	13位元		0~8191			 																		 */
//												Mode 1	16位元		0~65535                                          */
//												Mode 2	 8位元		0~255			具有自動載入功能                       */
//												Mode 3	 8位元		0~255                                            */
//------------------------------------------------------------------------------------------ */
#include <REG_MPC89L51-515.h>
#include "Interrupt.h"


void INT_Interrupt_Set(void) {
		
	/**  使用 Timer 0  **/
//		IE = 0x82;		//啟用T0中斷
//		TMOD = 1;			//設定T0為 Mode 1
//		TH0 = TH_M1;	//設置T0計數量：高8位元
//		TL0 = TL_M1;	//設置T0計數量：低8位元
//		TR0 = 1;			//啟動T0
	
	/**  使用 Timer 0 & Timer1 (沒設定優先順序) **/
		IE = 0x8A;		//啟動T0、T1
		IP = 0x02;		//T0優先
		TMOD = 0x11;	//設定T0、T1為Mode 1
		TCON = 0x50;	//啟動T0、T1
	//設定Timer0計時時間
		TH0 = TH_M1;	//設置T0計數量：高8位元
		TL0 = TL_M1;	//設置T0計數量：低8位元
	//設定Timer1計時時間	
		TH1 = TH_M1;	
		TL1 = TL_M1;	
}